railsapp/app/controllers/wp_controller.rb

SELECT * FROM `wp_posts` WHERE (post_status = "publish" and post_type = "post") ORDER BY post_date DESC LIMIT 10
---
    def index
	@blogposts = WpPost.find(	:all,
					:conditions => ['post_status = "publish" and post_type = "post"'],
					:limit => 10,
					:order => 'post_date DESC')